# SpotElevSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevSymbol Property
ParameterTypeId Class See Also
---
"Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevSymbol As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevSymbol {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace